{
    "task_type": "CAUSAL_LM",
    "peft_type": "LORA",
    "auto_mapping": null,
    "peft_version": "0.18.0",
    "base_model_name_or_path": "/workspace/models/Qwen2.5-7B-Instruct",
    "revision": null,
    "inference_mode": false,
    "r": 8,
    "target_modules": [
        "q_proj",
        "down_proj",
        "v_proj",
        "o_proj",
        "gate_proj",
        "k_proj",
        "up_proj"
    ],
    "exclude_modules": null,
    "lora_alpha": 16,
    "lora_dropout": 0.0,
    "fan_in_fan_out": false,
    "bias": "none",
    "use_rslora": false,
    "modules_to_save": null,
    "init_lora_weights": true,
    "layers_to_transform": null,
    "layers_pattern": null,
    "rank_pattern": {},
    "alpha_pattern": {},
    "megatron_config": null,
    "megatron_core": "megatron.core",
    "trainable_token_indices": null,
    "loftq_config": {},
    "eva_config": null,
    "corda_config": null,
    "use_dora": false,
    "alora_invocation_tokens": null,
    "use_qalora": false,
    "qalora_group_size": 16,
    "layer_replication": null,
    "runtime_config": {
        "ephemeral_gpu_offload": false
    },
    "lora_bias": false,
    "target_parameters": null,
    "arrow_config": null,
    "ensure_weight_tying": false
}